garyPenhook/PyAvrOCD/svd/avr16la28.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ADC0</name>
      <description>Analog to Digital Converter</description>
      <baseAddress>0x00800600</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x15</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>COMMAND</name>
          <description>Command</description>
          <addressOffset>0xA</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>START</name>
              <description>Start Conversion</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>Stop an ongoing conversion</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IMMEDIATE</name>
                  <description>Start a conversion immediately. This will be set back to STOP when the first conversion is done, unless Free-Running mode is enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUXPOS</name>
                  <description>Start when a write to the MUXPOS register is done</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVENT</name>
                  <description>Start when an event is received by the ADC</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>Mode</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINGLE_8BIT</name>
                  <description>Single Conversion with 8-bit resolution</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLE_10BIT</name>
                  <description>Single Conversion with 10-bit resolution</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SERIES</name>
                  <description>Series with accumulation, separate trigger for every 10-bit conversion</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BURST</name>
                  <description>Burst with accumulation, one trigger will run SAMPNUM 10-bit conversions in one sequence</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACCTEST</name>
                  <description>Accumulator diagnostic mode</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLA</name>
          <description>Control A</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>ADC Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LOWLAT</name>
              <description>Low Latency</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RUNSTDBY</name>
              <description>Run in Standby Mode</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLB</name>
          <description>Control B</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRESC</name>
              <description>ADC Prescaler</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>CLK_PER divided by 2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV3</name>
                  <description>CLK_PER divided by 3</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>CLK_PER divided by 4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV5</name>
                  <description>CLK_PER divided by 5</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV6</name>
                  <description>CLK_PER divided by 6</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV7</name>
                  <description>CLK_PER divided by 7</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <description>CLK_PER divided by 8</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV9</name>
                  <description>CLK_PER divided by 9</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV10</name>
                  <description>CLK_PER divided by 10</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV11</name>
                  <description>CLK_PER divided by 11</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV12</name>
                  <description>CLK_PER divided by 12</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV13</name>
                  <description>CLK_PER divided by 13</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV14</name>
                  <description>CLK_PER divided by 14</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV15</name>
                  <description>CLK_PER divided by 15</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV16</name>
                  <description>CLK_PER divided by 16</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV17</name>
                  <description>CLK_PER divided by 17</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV18</name>
                  <description>CLK_PER divided by 18</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV19</name>
                  <description>CLK_PER divided by 19</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV20</name>
                  <description>CLK_PER divided by 20</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV21</name>
                  <description>CLK_PER divided by 21</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV22</name>
                  <description>CLK_PER divided by 22</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV23</name>
                  <description>CLK_PER divided by 23</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV24</name>
                  <description>CLK_PER divided by 24</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV25</name>
                  <description>CLK_PER divided by 25</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV26</name>
                  <description>CLK_PER divided by 26</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV27</name>
                  <description>CLK_PER divided by 27</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV28</name>
                  <description>CLK_PER divided by 28</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV29</name>
                  <description>CLK_PER divided by 29</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV30</name>
                  <description>CLK_PER divided by 30</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV31</name>
                  <description>CLK_PER divided by 31</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV32</name>
                  <description>CLK_PER divided by 32</description>
                  <value>30</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLC</name>
          <description>Control C</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>REFSEL</name>
              <description>Reference Selection</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VDD</name>
                  <description>VDD</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTVREF</name>
                  <description>External reference from EXTVREF0 pin</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0V512</name>
                  <description>Internal reference 0.512 V</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1V024</name>
                  <description>Internal reference 1.024 V</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2V048</name>
                  <description>Internal reference 2.048 V</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V096</name>
                  <description>Internal reference 4.096 V</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2V500</name>
                  <description>Internal reference 2.500 V</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLD</name>
          <description>Control D</description>
          <addressOffset>0x3</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WINCM</name>
              <description>Window Comparator Mode</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No Window Comparison</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BELOW</name>
                  <description>OUTPUT &lt; WINLT</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ABOVE</name>
                  <description>OUTPUT &gt; WINHT</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INSIDE</name>
                  <description>WINLT &lt; OUTPUT &lt; WINHT</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTSIDE</name>
                  <description>OUTPUT &lt; WINLT or OUTPUT &gt;WINHT</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WINSRC</name>
              <description>Window Mode Source</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESULT</name>
                  <description>Use RESULT[15:0] as Window Comparator Source</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE</name>
                  <description>Use SAMPLE[15:0] as Window Comparator source</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLE</name>
          <description>Control E</description>
          <addressOffset>0x4</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SAMPDUR</name>
              <description>Sample Duration</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLF</name>
          <description>Control F</description>
          <addressOffset>0x5</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SAMPNUM</name>
              <description>Sample Accumulation Number Select</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No accumulation, single sample per conversion result</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACC2</name>
                  <description>2 samples accumulated</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACC4</name>
                  <description>4 samples accumulated</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACC8</name>
                  <description>8 samples accumulated</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACC16</name>
                  <description>16 samples accumulated</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACC32</name>
                  <description>32 samples accumulated</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACC64</name>
                  <description>64 samples accumulated</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACC128</name>
                  <description>128 samples accumulated</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACC256</name>
                  <description>256 samples accumulated</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACC512</name>
                  <description>512 samples accumulated</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACC1024</name>
                  <description>1024 samples accumulated</description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCALING</name>
              <description>Result Scaling</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>ADC output of sample or accumulated result is right adjusted. If accumulating more then 64 samples,
result is left adjusted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEFTADJ</name>
                  <description>ADC output is left adjusted</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE</name>
                  <description>Accumulated ADC result is averaged and right adjusted</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FREERUN</name>
              <description>Free Running</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGCTRL</name>
          <description>Debug Control</description>
          <addressOffset>0x9</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DBGRUN</name>
              <description>Run in Debug Mode</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTCTRL</name>
          <description>Interrupt Control</description>
          <addressOffset>0x6</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESRDY</name>
              <description>Result Ready Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SAMPRDY</name>
              <description>Sample Ready Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WCMP</name>
              <description>Window Comparator Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESOVR</name>
              <description>Result Overwrite Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SAMPOVR</name>
              <description>Sample Overwrite Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIGOVR</name>
              <description>Trigger Overrun Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
